In [1]:
import os
import pandas as pd
import json
from sqlalchemy import create_engine, inspect, func
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
# Base = automap_base()

In [2]:
json_file = "/Resources/top100movies.json"
top100_df = pd.read_json(json_file)
top100_df.head()

                            title  rank         id
0        The Shawshank Redemption     1  tt0111161
1                   The Godfather     2  tt0068646
2          The Godfather: Part II     3  tt0071562
3                    Pulp Fiction     4  tt0110912
4  The Good, the Bad and the Ugly     5  tt0060196

In [3]:
rds_connection_string = "postgres:postgres@localhost:5432/top100movies"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [4]:
# print(engine)
engine.table_names()

['top100movie', 'kagglemovies', 'kaggleMovies']

In [ ]:
top100_df.to_sql(name='top100movie', con=engine, if_exists='append', index=False)

In [5]:
csv_file="/Resources/smallimdb.csv"
kaggleMovies_df = pd.read_csv(csv_file)
kaggleMovies_df.head()

,Unnamed: 0,imdb_title_id,original_title,title,avg_vote,votes
0,0,tt0000009,Miss Jerry,Miss Jerry,5.9,154
1,1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,6.1,589
2,2,tt0001892,Den sorte drøm,Den sorte drøm,5.8,188
3,3,tt0002101,Cleopatra,Cleopatra,5.2,446
4,4,tt0002130,L'Inferno,L'Inferno,7.0,2237

In [7]:
kaggleMovies_df.columns

Index(['Unnamed: 0', 'imdb_title_id', 'original_title', 'title', 'avg_vote',
       'votes'],
      dtype='object')

In [8]:
kaggleMovies_df=kaggleMovies_df[["imdb_title_id", "title", "avg_vote"]]

In [9]:
kaggleMovies_df.head()

  imdb_title_id                        title  avg_vote
0     tt0000009                   Miss Jerry       5.9
1     tt0000574  The Story of the Kelly Gang       6.1
2     tt0001892               Den sorte drøm       5.8
3     tt0002101                    Cleopatra       5.2
4     tt0002130                    L'Inferno       7.0

In [14]:
kaggleMovies_df.to_sql(name='kaggle', con=engine, if_exists='append', index=False)